app/controllers/api/v1/library_controller.rb

            def index
                books = Book.order('id ASC');
---
SELECT `books`.* FROM `books` ORDER BY id ASC

            def show
                book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 12 LIMIT 1

            def create
                book = Book.new(book_params)
                if book.save
---
INSERT INTO `books` (`title`, `author`, `publisher`, `year`) VALUES ('Web Programming', 'Suvidha KS', 'NITC', 2021)

            def destroy
                book = Book.find(params[:id])
                book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 16 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 16

            def update
               book = Book.find(params[:id])
               if book.update(book_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 5 LIMIT 1
UPDATE `books` SET `books`.`title` = 'test', `books`.`author` = 'test', `books`.`publisher` = 'a ', `books`.`year` = 1234 WHERE `books`.`id` = 54